{
  "2025-08-07": {
    "quote": "If you’re waiting for a sign, this isn’t it. Figure it out.",
    "signRoasts": {
      "Aries": "Your energy is unmatched. So is your ability to mess things up quickly.",
      "Taurus": "You're doing amazing. At avoiding responsibilities.",
      "Gemini": "You're not everyone's cup of tea. You're more like chaotic espresso.",
      "Cancer": "Feelings are not facts. Calm down.",
      "Leo": "Your spotlight obsession is exhausting — for the rest of us.",
      "Virgo": "Perfection isn't possible. But keep spiraling.",
      "Libra": "Trying to please everyone? Good luck with that, sweetie.",
      "Scorpio": "Your trust issues have trust issues.",
      "Sagittarius": "You ghost more than Wi-Fi in the countryside.",
      "Capricorn": "You're not a robot. Try relaxing without guilt. Just once.",
      "Aquarius": "You’re quirky. We get it. Now sit down.",
      "Pisces": "Your daydreams won’t pay rent. Wake up, moonchild."
    }
  },
  "2025-08-08": {
    "quote": "Stop blaming Mercury. You were a mess before retrograde.",
    "signRoasts": {
      "Aries": "You rushed into another mess? Shocking.",
      "Taurus": "You're still flawless. Still stubborn. Still ignoring everyone.",
      "Gemini": "You're not a personality quiz, pick a lane.",
      "Cancer": "Crying again? It's 9AM. Impressive.",
      "Leo": "Not everything needs to be about you. But nice try.",
      "Virgo": "You reorganized your anxiety. Congrats.",
      "Libra": "Still can’t decide? Classic.",
      "Scorpio": "Your mystery is just avoidance with eyeliner.",
      "Sagittarius": "Running away isn’t growth. It’s cardio.",
      "Capricorn": "Work isn’t therapy. Stop treating it like it is.",
      "Aquarius": "You’re not above feelings. You’re just bad at them.",
      "Pisces": "Dreaming again? Cool. Wake up though."
    }
  },
  "2025-08-09": {
    "quote": "Hydrate. Not emotionally — with actual water.",
    "signRoasts": {
      "Aries": "Your energy will be unstoppable today, but coffee isn’t water, champ.",
      "Taurus": "Comfort is your priority, but maybe include a glass of water with that snack.",
      "Gemini": "Conversations will flow — unlike your water intake.",
      "Cancer": "Emotions are high tide, but tears won’t hydrate you.",
      "Leo": "Attention will find you, but so should a reusable bottle.",
      "Virgo": "A productive streak is coming, but dehydration will ruin your flow.",
      "Libra": "A decision about sparkling or still may derail your morning.",
      "Scorpio": "Passions run deep today, but so will your thirst if you ignore it.",
      "Sagittarius": "Adventure calls — pack more than one sip of water.",
      "Capricorn": "Work momentum is strong, but breaks aren’t weakness.",
      "Aquarius": "You’ll crave novelty; water is still allowed to be basic.",
      "Pisces": "Your dreams feel vivid — maybe because you’re slightly dried out."
    }
  },
  "2025-08-10": {
    "quote": "Your intuition is right. Unfortunately.",
    "signRoasts": {
      "Aries": "A flash of insight hits, but you’ll still jump in headfirst.",
      "Taurus": "Your gut will whisper the truth, but comfort will talk louder.",
      "Gemini": "An inner voice warns you — you’ll probably debate it out loud anyway.",
      "Cancer": "Your hunch is spot-on, yet your heart will try to rewrite the ending.",
      "Leo": "Validation arrives, and you’ll frame it as proof you’re always right.",
      "Virgo": "Details confirm what you suspected — try not to micromanage destiny.",
      "Libra": "Instinct will settle the matter, unless you crowdsource more opinions.",
      "Scorpio": "Your sixth sense is sharp — so is the smirk you’ll wear all day.",
      "Sagittarius": "Signs will be obvious; whether you stay put is another story.",
      "Capricorn": "The forecast is clear — and you’ve already built a backup plan.",
      "Aquarius": "Your prediction lands, though you’ll credit ‘data,’ not feelings.",
      "Pisces": "The dream was right, but you’ll still test it the hard way."
    }
  },
  "2025-08-11": {
    "quote": "Don’t chase. Attract. Then ignore them.",
    "signRoasts": {
      "Aries": "The spotlight finds you, but you’ll be too busy moving to notice.",
      "Taurus": "Admiration comes your way; you’ll act like you didn’t see it.",
      "Gemini": "Magnetic energy today — until you vanish mid-conversation.",
      "Cancer": "Someone approaches, but you’ll retreat into your comfort shell.",
      "Leo": "The crowd adores you, but you’ll get bored of the applause.",
      "Virgo": "Attention finds you — only to be met with your critique.",
      "Libra": "Your charm draws people in, indecision sends them out.",
      "Scorpio": "They’ll chase your mystery, and you’ll enjoy shutting the door.",
      "Sagittarius": "Interest sparks, but your travel plans come first.",
      "Capricorn": "Opportunities show up — you’ll pencil them in for next month.",
      "Aquarius": "People match your vibe, you’ll still act like you’re above it.",
      "Pisces": "They’ll fall for the dream; you’ll wake up and leave."
    }
  },
  "2025-08-12": {
    "quote": "Growth is painful. So is your taste in people.",
    "signRoasts": {
      "Aries": "Progress feels real today — just avoid dating chaos magnets.",
      "Taurus": "Stability grows, but so might your attachment to bad habits.",
      "Gemini": "Lessons land, but you’ll still text the red flag at midnight.",
      "Cancer": "You’re healing, yet watering dead emotional plants again.",
      "Leo": "Self-awareness rises, but so does your taste for drama.",
      "Virgo": "Fixing people won’t count as personal growth, no matter how neat.",
      "Libra": "Love lessons return — and so does your taste for challenges.",
      "Scorpio": "Transformation thrives, but revenge will still tempt you.",
      "Sagittarius": "Wisdom expands, yet so does your questionable dating history.",
      "Capricorn": "You’ll level up — but your romance choices remain an HR violation.",
      "Aquarius": "Growth is happening, but you’ll still collect weirdos like art.",
      "Pisces": "Emotional clarity comes, but you’ll romanticize the mess."
    }
  },
  "2025-08-13": {
    "quote": "You’re not tired. You’re uninspired.",
    "signRoasts": {
      "Aries": "The fire’s still there — you’re just chasing the wrong spark.",
      "Taurus": "Energy dips, not because you’re exhausted, but because the couch exists.",
      "Gemini": "Ideas swirl, yet none land long enough to excite you.",
      "Cancer": "Your mood feels heavy, but it’s boredom wearing a disguise.",
      "Leo": "The stage feels dull; maybe the problem isn’t the stage.",
      "Virgo": "You’ve organized your day to death — no wonder it’s lifeless.",
      "Libra": "The scales feel off because nothing’s thrilling you.",
      "Scorpio": "Motivation hides; plotting isn’t the same as doing.",
      "Sagittarius": "Restlessness hits, but adventure feels too far away.",
      "Capricorn": "Work is steady, but passion’s running on empty.",
      "Aquarius": "Routine is choking your weird — shake it up.",
      "Pisces": "Your dreams feel more alive than your to-do list."
    }
  },
  "2025-08-14": {
    "quote": "Be the main character. But not in a cringe way.",
    "signRoasts": {
      "Aries": "The plot moves fast — make sure it’s not just a chase scene.",
      "Taurus": "Slow and steady is fine, unless the movie’s boring.",
      "Gemini": "Your subplot is stealing the show; maybe focus on one arc.",
      "Cancer": "Tears will roll in 4K — Oscar-worthy or overdone?",
      "Leo": "Every scene’s yours, but not every scene needs you.",
      "Virgo": "You’re directing and starring, but also over-editing.",
      "Libra": "The cast loves you — stop auditioning for approval.",
      "Scorpio": "You’re craving a twist; just don’t set fire to the script.",
      "Sagittarius": "Your role today is ‘escape artist,’ not hero.",
      "Capricorn": "Ambition’s the plot, but even thrillers need downtime.",
      "Aquarius": "You’re the eccentric sidekick — embrace it.",
      "Pisces": "The dreamy romantic arc could use subtitles."
    }
  },
  "2025-08-15": {
    "quote": "You survived worse. Like last Monday.",
    "signRoasts": {
      "Aries": "Another crisis passes; somehow you’re already chasing the next one.",
      "Taurus": "Resilience shows, but so does your need for a snack break.",
      "Gemini": "You lived, you laughed, you told the group chat everything.",
      "Cancer": "You got through it — with dramatic sighs for effect.",
      "Leo": "You survived and turned it into a TED Talk.",
      "Virgo": "Your coping method involved spreadsheets — again.",
      "Libra": "The storm passed, but you’re still deciding how you feel about it.",
      "Scorpio": "You made it through — and left a few scorched bridges behind.",
      "Sagittarius": "You outran the problem, just barely.",
      "Capricorn": "You pushed through like it was a quarterly report.",
      "Aquarius": "You stayed detached, maybe too detached.",
      "Pisces": "You drifted through it in your own emotional current."
    }
  },
  "2025-08-16": {
    "quote": "Not everyone deserves your energy. Especially Steve.",
    "signRoasts": {
      "Aries": "Your fire burns bright today — don’t waste it on people who run cold.",
      "Taurus": "Save your effort for what feeds you, not what drains you.",
      "Gemini": "Your words hold power, but some folks aren’t worth the monologue.",
      "Cancer": "Protect your peace; not every sob story is your mission.",
      "Leo": "Your glow’s strong — stop shining on those who can’t reflect it.",
      "Virgo": "Invest energy in progress, not pointless fixes.",
      "Libra": "Your charm isn’t a free resource for time-wasters.",
      "Scorpio": "Not everyone deserves the inside scoop on your life.",
      "Sagittarius": "Your vibe’s high — no need to lower it for company.",
      "Capricorn": "Keep focus on your goals, not petty distractions.",
      "Aquarius": "Your ideas are gold — stop pitching them to fools.",
      "Pisces": "Your empathy’s strong; aim it at someone who cares."
    }
  },
  "2025-08-17": {
    "quote": "Your standards aren’t too high — they’re just finally accurate.",
    "signRoasts": {
      "Aries": "Today you’ll want more, and that’s not arrogance — it’s survival.",
      "Taurus": "Quality over quantity wins; keep your bar steady.",
      "Gemini": "Your shifting tastes settle for once — make them count.",
      "Cancer": "Emotional boundaries hold firm today; it’s about time.",
      "Leo": "You’ll expect the best and watch mediocrity scurry away.",
      "Virgo": "You’re right to refine your checklist — it’s filtering the noise.",
      "Libra": "Your balance today comes from not settling, finally.",
      "Scorpio": "You’ll demand depth — and walk when it’s shallow.",
      "Sagittarius": "Freedom feels better without dead weight tagging along.",
      "Capricorn": "Your bar is high because you’ve climbed higher.",
      "Aquarius": "You’re attracting those who get it — not those who drain it.",
      "Pisces": "Your heart’s choosier now, and it’s a good look."
    }
  },
  "2025-08-18": {
    "quote": "Take the risk. Regret is worse than rejection.",
    "signRoasts": {
      "Aries": "Bold moves pay off today — hesitation will just annoy you.",
      "Taurus": "Comfort zones feel safe, but boredom isn’t worth it.",
      "Gemini": "Your charm works best when you actually commit.",
      "Cancer": "Playing it safe protects feelings, but stunts growth.",
      "Leo": "The spotlight’s waiting — step into it or someone else will.",
      "Virgo": "Calculated risks count; overthinking will miss the window.",
      "Libra": "Balance is fine, but boldness gets noticed today.",
      "Scorpio": "Go all in; mystery doesn’t close deals.",
      "Sagittarius": "Adventure’s knocking — open up already.",
      "Capricorn": "A career leap could stick — don’t over-plan it away.",
      "Aquarius": "Your idea’s ahead of its time; launch it anyway.",
      "Pisces": "Follow the vision; fear’s the only real block."
    }
  },
  "2025-08-19": {
    "quote": "You don’t need a sign. You need a nap.",
    "signRoasts": {
      "Aries": "The green light’s real, but you’re too tired to floor it.",
      "Taurus": "Today’s vibe is horizontal — lean into it.",
      "Gemini": "Your mind’s buzzing, but your body wants off the ride.",
      "Cancer": "Sometimes recharging beats reacting.",
      "Leo": "Rest now; you can reclaim the spotlight tomorrow.",
      "Virgo": "Organizing in your sleep still counts as rest, right?",
      "Libra": "Peace comes from quiet, not more input.",
      "Scorpio": "Even plotting works better after a recharge.",
      "Sagittarius": "Your wanderlust can wait for morning.",
      "Capricorn": "Efficiency starts with energy — refill it.",
      "Aquarius": "Innovation thrives after you stop pushing.",
      "Pisces": "Dreaming counts as spiritual homework today."
    }
  },
  "2025-08-20": {
    "quote": "Protect your peace — even from group chats.",
    "signRoasts": {
      "Aries": "Your patience is thinner than your phone battery.",
      "Taurus": "Mute buttons exist for a reason — use them.",
      "Gemini": "Not every notification deserves your genius reply.",
      "Cancer": "Emotional boundaries mean unread messages are okay.",
      "Leo": "If it’s not applause, let it wait.",
      "Virgo": "Chaos in the chat doesn’t need your project plan.",
      "Libra": "Your diplomacy is wasted on emoji wars.",
      "Scorpio": "You can vanish without explanation — it’s your art.",
      "Sagittarius": "Silence isn’t rude when it’s for your sanity.",
      "Capricorn": "Group drama isn’t part of your KPIs.",
      "Aquarius": "Your detachment skill is peak today — embrace it.",
      "Pisces": "Your vibe stays higher when the phone’s face-down."
    }
  },
  "2025-08-21": {
    "quote": "Resting is productive. Crying counts too.",
    "signRoasts": {
      "Aries": "Pause before burnout turns you into a wildfire.",
      "Taurus": "A slow day feeds your strength more than you think.",
      "Gemini": "Reflection beats running in circles.",
      "Cancer": "Tears are your emotional pressure valve — let them flow.",
      "Leo": "Even royalty needs a break from the throne.",
      "Virgo": "Today’s to-do list: nothing, and mean it.",
      "Libra": "Balance is rest too, not just action.",
      "Scorpio": "Still waters sharpen the sting later.",
      "Sagittarius": "You can’t chase sunsets every day — take five.",
      "Capricorn": "Recovery is an investment, not a loss.",
      "Aquarius": "Innovation sneaks in when you’re still.",
      "Pisces": "Your soul work happens best in quiet moments."
    }
  },
  "2025-08-22": {
    "quote": "Confidence looks good on you. Arrogance doesn’t.",
    "signRoasts": {
      "Aries": "Lead with certainty, not volume.",
      "Taurus": "Stability is strength; flaunting it is overkill.",
      "Gemini": "Your wit sparkles — just don’t turn it into a weapon.",
      "Cancer": "Soft confidence beats defensive walls.",
      "Leo": "You own the room, but let them breathe too.",
      "Virgo": "Precision speaks louder than smugness.",
      "Libra": "Charm doesn’t need constant validation.",
      "Scorpio": "Intensity is magnetic — unless it’s suffocating.",
      "Sagittarius": "Freedom shines when you’re not preaching it.",
      "Capricorn": "Authority’s natural — arrogance takes effort.",
      "Aquarius": "Originality impresses more than superiority.",
      "Pisces": "Grace wins over the urge to prove yourself."
    }
  },
  "2025-08-23": {
    "quote": "Everyone’s rooting for you. Even the petty ones.",
    "signRoasts": {
      "Aries": "Your wins fire up allies — and rivals in equal measure.",
      "Taurus": "Steady progress earns claps, even from critics.",
      "Gemini": "Your charm wins fans, grudging or not.",
      "Cancer": "Your persistence forces respect.",
      "Leo": "Even envy looks like admiration on you.",
      "Virgo": "Your results speak louder than their side-eyes.",
      "Libra": "Your grace gets noticed, even by the jealous.",
      "Scorpio": "Haters cheer quietly when you’re out of earshot.",
      "Sagittarius": "Even the ones you left behind watch you win.",
      "Capricorn": "Your grind wins nods, even from competitors.",
      "Aquarius": "They may not get you, but they still bet on you.",
      "Pisces": "Your softness wins over even the bitter hearts."
    }
  },
  "2025-08-24": {
    "quote": "Rejection is redirection. Toward someone better.",
    "signRoasts": {
      "Aries": "One ‘no’ clears the path for a bigger yes.",
      "Taurus": "The wrong fit falls away to make space for gold.",
      "Gemini": "Every closed door is a plot twist you’ll retell.",
      "Cancer": "Not everyone deserves access to your heart anyway.",
      "Leo": "A bruise now saves a scar later.",
      "Virgo": "Precision pays — this was the wrong match by design.",
      "Libra": "A better balance is ahead; trust the reset.",
      "Scorpio": "This rejection just sharpened your aim.",
      "Sagittarius": "The detour’s better than the dead end you avoided.",
      "Capricorn": "The no today protects your long game.",
      "Aquarius": "The universe just filtered out bad code.",
      "Pisces": "A new tide’s coming in — this one was sinking."
    }
  },
  "2025-08-25": {
    "quote": "Trust the timing. Or blame Saturn.",
    "signRoasts": {
      "Aries": "The wait drags, but the launch will be sweeter.",
      "Taurus": "Patience is the power move today.",
      "Gemini": "Delays are just plot twists in your timeline.",
      "Cancer": "The pause protects your peace.",
      "Leo": "Saturn’s slow pace teaches humility — reluctantly.",
      "Virgo": "Trust the process, not your stopwatch.",
      "Libra": "Balance comes from letting the clock work its magic.",
      "Scorpio": "Power builds in stillness; use it.",
      "Sagittarius": "Adventure waits until the map’s ready.",
      "Capricorn": "Saturn’s rules favor your discipline.",
      "Aquarius": "The timing will sync once you stop fighting it.",
      "Pisces": "The tide knows when to pull you forward."
    }
  },
  "2025-08-26": {
    "quote": "You’re glowing. It might be rage, but still.",
    "signRoasts": {
      "Aries": "The fire’s visible today — channel it or burn bridges.",
      "Taurus": "Your steady shine hides a slow simmer.",
      "Gemini": "Your sparkle comes with a side of side-eye.",
      "Cancer": "Emotions light you up, for better or worse.",
      "Leo": "Your radiance today could scorch a few egos.",
      "Virgo": "Polished outside, boiling point inside.",
      "Libra": "The glow attracts — they just don’t know it’s dangerous.",
      "Scorpio": "Your allure today is slightly menacing.",
      "Sagittarius": "Your warmth is real — so’s the wildfire risk.",
      "Capricorn": "The shine comes with sharp edges.",
      "Aquarius": "You’re radiant, but untouchable.",
      "Pisces": "The dreamy light has a storm under it."
    }
  },
  "2025-08-27": {
    "quote": "You’re not behind. You’re just on Taurus Time™.",
    "signRoasts": {
      "Aries": "The pace feels slow, but you’re still ahead of the pack.",
      "Taurus": "Your timeline is the only one that matters.",
      "Gemini": "Others sprint; you’re busy enjoying the detour.",
      "Cancer": "The slower rhythm keeps you steady.",
      "Leo": "You’re not late — you’re perfectly dramatic.",
      "Virgo": "Every step lands exactly where it should.",
      "Libra": "Balance beats rushing ahead today.",
      "Scorpio": "You’re strategic, not slow.",
      "Sagittarius": "You’ll get there, but the view’s worth savoring.",
      "Capricorn": "Patience strengthens your next move.",
      "Aquarius": "Time bends around your vision anyway.",
      "Pisces": "The flow’s on your side — no hurry."
    }
  },
  "2025-08-28": {
    "quote": "If it doesn’t bring peace, put it down.",
    "signRoasts": {
      "Aries": "Drop the fight that’s just for ego points.",
      "Taurus": "Let go of what rattles your calm.",
      "Gemini": "The drama isn’t worth the story today.",
      "Cancer": "Peace matters more than proving you’re right.",
      "Leo": "Your spotlight shines brighter without chaos in the frame.",
      "Virgo": "Perfection can wait — serenity first.",
      "Libra": "Choose harmony over the endless debate.",
      "Scorpio": "Release the grudge before it poisons your day.",
      "Sagittarius": "Lighten the load for smoother travel.",
      "Capricorn": "Efficiency thrives in a quiet mind.",
      "Aquarius": "Let your headspace breathe today.",
      "Pisces": "Keep only what keeps you soft."
    }
  },
  "2025-08-29": {
    "quote": "You’re the vibe. Others are buffering.",
    "signRoasts": {
      "Aries": "Your pace leaves others struggling to catch up.",
      "Taurus": "Your steady aura outlasts the noise.",
      "Gemini": "You’re miles ahead in the conversation.",
      "Cancer": "Your mood sets the tone for the room.",
      "Leo": "Everyone’s watching your channel today.",
      "Virgo": "Your clarity makes the lag obvious.",
      "Libra": "You’re the playlist they can’t skip.",
      "Scorpio": "Your intensity freezes weaker signals.",
      "Sagittarius": "You’re already onto the next adventure.",
      "Capricorn": "You’re the download that’s worth the wait.",
      "Aquarius": "Your wavelength is hard to tune into.",
      "Pisces": "You’re streaming pure fantasy energy."
    }
  },
  "2025-08-30": {
    "quote": "Let them underestimate you. It’s cute.",
    "signRoasts": {
      "Aries": "They’ll doubt you until they’re eating your dust.",
      "Taurus": "Their underestimation just buys you more time to win.",
      "Gemini": "The surprise ending is your specialty.",
      "Cancer": "Soft doesn’t mean weak — they’ll learn.",
      "Leo": "You’ll turn their doubt into applause.",
      "Virgo": "Quiet wins leave the deepest mark.",
      "Libra": "Charm your way past their low bar.",
      "Scorpio": "Let them guess wrong — it’s fuel.",
      "Sagittarius": "You’ll outrun their expectations easily.",
      "Capricorn": "They’ll regret betting against your grind.",
      "Aquarius": "You’ll outsmart them without breaking a sweat.",
      "Pisces": "Your magic works best when they’re not looking."
    }
  },
  "2025-08-31": {
    "quote": "You are the table. Stop begging for a seat.",
    "signRoasts": {
      "Aries": "You build the stage and run the show — act like it.",
      "Taurus": "Your stability is the foundation everyone else leans on.",
      "Gemini": "You bring the whole conversation — and the snacks.",
      "Cancer": "You hold the emotional glue this group runs on.",
      "Leo": "Without you, the spotlight’s just a flashlight.",
      "Virgo": "You keep it all running; they should be chasing you.",
      "Libra": "You are the balance they can’t replicate.",
      "Scorpio": "Your presence changes the entire game.",
      "Sagittarius": "You bring the stories worth staying for.",
      "Capricorn": "You’re the infrastructure everyone depends on.",
      "Aquarius": "Your ideas are the main course here.",
      "Pisces": "You're the atmosphere they can't fake."
    }
  },
  "2025-11-17": {
    "quote": "Your potential is showing. So is your procrastination.",
    "signRoasts": {
      "Aries": "Your energy is unmatched. So is your ability to mess things up quickly.",
      "Taurus": "You're doing amazing. At avoiding responsibilities.",
      "Gemini": "You're not everyone's cup of tea. You're more like chaotic espresso.",
      "Cancer": "Feelings are not facts. Calm down.",
      "Leo": "Your spotlight obsession is exhausting — for the rest of us.",
      "Virgo": "Perfection isn't possible. But keep spiraling.",
      "Libra": "Trying to please everyone? Good luck with that, sweetie.",
      "Scorpio": "Your trust issues have trust issues.",
      "Sagittarius": "You ghost more than Wi-Fi in the countryside.",
      "Capricorn": "You're not a robot. Try relaxing without guilt. Just once.",
      "Aquarius": "You're quirky. We get it. Now sit down.",
      "Pisces": "Your daydreams won't pay rent. Wake up, moonchild."
    }
  },
  "2025-11-18": {
    "quote": "Your excuses are getting creative. Still excuses though.",
    "signRoasts": {
      "Aries": "You rushed into another mess? Shocking.",
      "Taurus": "You're still flawless. Still stubborn. Still ignoring everyone.",
      "Gemini": "You're not a personality quiz, pick a lane.",
      "Cancer": "Crying again? It's 9AM. Impressive.",
      "Leo": "Not everything needs to be about you. But nice try.",
      "Virgo": "You reorganized your anxiety. Congrats.",
      "Libra": "Still can't decide? Classic.",
      "Scorpio": "Your mystery is just avoidance with eyeliner.",
      "Sagittarius": "Running away isn't growth. It's cardio.",
      "Capricorn": "Work isn't therapy. Stop treating it like it is.",
      "Aquarius": "You're not above feelings. You're just bad at them.",
      "Pisces": "Dreaming again? Cool. Wake up though."
    }
  },
  "2025-11-19": {
    "quote": "Hydrate. Not emotionally — with actual water.",
    "signRoasts": {
      "Aries": "Your energy will be unstoppable today, but coffee isn't water, champ.",
      "Taurus": "Comfort is your priority, but maybe include a glass of water with that snack.",
      "Gemini": "Conversations will flow — unlike your water intake.",
      "Cancer": "Emotions are high tide, but tears won't hydrate you.",
      "Leo": "Attention will find you, but so should a reusable bottle.",
      "Virgo": "A productive streak is coming, but dehydration will ruin your flow.",
      "Libra": "A decision about sparkling or still may derail your morning.",
      "Scorpio": "Passions run deep today, but so will your thirst if you ignore it.",
      "Sagittarius": "Adventure calls — pack more than one sip of water.",
      "Capricorn": "Work momentum is strong, but breaks aren't weakness.",
      "Aquarius": "You'll crave novelty; water is still allowed to be basic.",
      "Pisces": "Your dreams feel vivid — maybe because you're slightly dried out."
    }
  },
  "2025-11-20": {
    "quote": "Your intuition is right. Unfortunately.",
    "signRoasts": {
      "Aries": "A flash of insight hits, but you'll still jump in headfirst.",
      "Taurus": "Your gut will whisper the truth, but comfort will talk louder.",
      "Gemini": "An inner voice warns you — you'll probably debate it out loud anyway.",
      "Cancer": "Your hunch is spot-on, yet your heart will try to rewrite the ending.",
      "Leo": "Validation arrives, and you'll frame it as proof you're always right.",
      "Virgo": "Details confirm what you suspected — try not to micromanage destiny.",
      "Libra": "Instinct will settle the matter, unless you crowdsource more opinions.",
      "Scorpio": "Your sixth sense is sharp — so is the smirk you'll wear all day.",
      "Sagittarius": "Signs will be obvious; whether you stay put is another story.",
      "Capricorn": "The forecast is clear — and you've already built a backup plan.",
      "Aquarius": "Your prediction lands, though you'll credit 'data,' not feelings.",
      "Pisces": "The dream was right, but you'll still test it the hard way."
    }
  },
  "2025-11-21": {
    "quote": "Don't chase. Attract. Then ignore them.",
    "signRoasts": {
      "Aries": "The spotlight finds you, but you'll be too busy moving to notice.",
      "Taurus": "Admiration comes your way; you'll act like you didn't see it.",
      "Gemini": "Magnetic energy today — until you vanish mid-conversation.",
      "Cancer": "Someone approaches, but you'll retreat into your comfort shell.",
      "Leo": "The crowd adores you, but you'll get bored of the applause.",
      "Virgo": "Attention finds you — only to be met with your critique.",
      "Libra": "Your charm draws people in, indecision sends them out.",
      "Scorpio": "They'll chase your mystery, and you'll enjoy shutting the door.",
      "Sagittarius": "Interest sparks, but your travel plans come first.",
      "Capricorn": "Opportunities show up — you'll pencil them in for next month.",
      "Aquarius": "People match your vibe, you'll still act like you're above it.",
      "Pisces": "They'll fall for the dream; you'll wake up and leave."
    }
  },
  "2025-11-22": {
    "quote": "Growth is painful. So is your taste in people.",
    "signRoasts": {
      "Aries": "Progress feels real today — just avoid dating chaos magnets.",
      "Taurus": "Stability grows, but so might your attachment to bad habits.",
      "Gemini": "Lessons land, but you'll still text the red flag at midnight.",
      "Cancer": "You're healing, yet watering dead emotional plants again.",
      "Leo": "Self-awareness rises, but so does your taste for drama.",
      "Virgo": "Fixing people won't count as personal growth, no matter how neat.",
      "Libra": "Love lessons return — and so does your taste for challenges.",
      "Scorpio": "Transformation thrives, but revenge will still tempt you.",
      "Sagittarius": "Wisdom expands, yet so does your questionable dating history.",
      "Capricorn": "You'll level up — but your romance choices remain an HR violation.",
      "Aquarius": "Growth is happening, but you'll still collect weirdos like art.",
      "Pisces": "Emotional clarity comes, but you'll romanticize the mess."
    }
  },
  "2025-11-23": {
    "quote": "You're not tired. You're uninspired.",
    "signRoasts": {
      "Aries": "The fire's still there — you're just chasing the wrong spark.",
      "Taurus": "Energy dips, not because you're exhausted, but because the couch exists.",
      "Gemini": "Ideas swirl, yet none land long enough to excite you.",
      "Cancer": "Your mood feels heavy, but it's boredom wearing a disguise.",
      "Leo": "The stage feels dull; maybe the problem isn't the stage.",
      "Virgo": "You've organized your day to death — no wonder it's lifeless.",
      "Libra": "The scales feel off because nothing's thrilling you.",
      "Scorpio": "Motivation hides; plotting isn't the same as doing.",
      "Sagittarius": "Restlessness hits, but adventure feels too far away.",
      "Capricorn": "Work is steady, but passion's running on empty.",
      "Aquarius": "Routine is choking your weird — shake it up.",
      "Pisces": "Your dreams feel more alive than your to-do list."
    }
  },
  "2025-11-24": {
    "quote": "Be the main character. But not in a cringe way.",
    "signRoasts": {
      "Aries": "The plot moves fast — make sure it's not just a chase scene.",
      "Taurus": "Slow and steady is fine, unless the movie's boring.",
      "Gemini": "Your subplot is stealing the show; maybe focus on one arc.",
      "Cancer": "Tears will roll in 4K — Oscar-worthy or overdone?",
      "Leo": "Every scene's yours, but not every scene needs you.",
      "Virgo": "You're directing and starring, but also over-editing.",
      "Libra": "The cast loves you — stop auditioning for approval.",
      "Scorpio": "You're craving a twist; just don't set fire to the script.",
      "Sagittarius": "Your role today is 'escape artist,' not hero.",
      "Capricorn": "Ambition's the plot, but even thrillers need downtime.",
      "Aquarius": "You're the eccentric sidekick — embrace it.",
      "Pisces": "The dreamy romantic arc could use subtitles."
    }
  },
  "2025-11-25": {
    "quote": "You survived worse. You'll survive this.",
    "signRoasts": {
      "Aries": "Another crisis passes; somehow you're already chasing the next one.",
      "Taurus": "Resilience shows, but so does your need for a snack break.",
      "Gemini": "You lived, you laughed, you told the group chat everything.",
      "Cancer": "You got through it — with dramatic sighs for effect.",
      "Leo": "You survived and turned it into a TED Talk.",
      "Virgo": "Your coping method involved spreadsheets — again.",
      "Libra": "The storm passed, but you're still deciding how you feel about it.",
      "Scorpio": "You made it through — and left a few scorched bridges behind.",
      "Sagittarius": "You outran the problem, just barely.",
      "Capricorn": "You pushed through like it was a quarterly report.",
      "Aquarius": "You stayed detached, maybe too detached.",
      "Pisces": "You drifted through it in your own emotional current."
    }
  },
  "2025-11-26": {
    "quote": "Not everyone deserves your energy. Especially Steve.",
    "signRoasts": {
      "Aries": "Your fire burns bright today — don't waste it on people who run cold.",
      "Taurus": "Save your effort for what feeds you, not what drains you.",
      "Gemini": "Your words hold power, but some folks aren't worth the monologue.",
      "Cancer": "Protect your peace; not every sob story is your mission.",
      "Leo": "Your glow's strong — stop shining on those who can't reflect it.",
      "Virgo": "Invest energy in progress, not pointless fixes.",
      "Libra": "Your charm isn't a free resource for time-wasters.",
      "Scorpio": "Not everyone deserves the inside scoop on your life.",
      "Sagittarius": "Your vibe's high — no need to lower it for company.",
      "Capricorn": "Keep focus on your goals, not petty distractions.",
      "Aquarius": "Your ideas are gold — stop pitching them to fools.",
      "Pisces": "Your empathy's strong; aim it at someone who cares."
    }
  },
  "2025-11-27": {
    "quote": "Your standards aren't too high — they're just finally accurate.",
    "signRoasts": {
      "Aries": "Today you'll want more, and that's not arrogance — it's survival.",
      "Taurus": "Quality over quantity wins; keep your bar steady.",
      "Gemini": "Your shifting tastes settle for once — make them count.",
      "Cancer": "Emotional boundaries hold firm today; it's about time.",
      "Leo": "You'll expect the best and watch mediocrity scurry away.",
      "Virgo": "You're right to refine your checklist — it's filtering the noise.",
      "Libra": "Your balance today comes from not settling, finally.",
      "Scorpio": "You'll demand depth — and walk when it's shallow.",
      "Sagittarius": "Freedom feels better without dead weight tagging along.",
      "Capricorn": "Your bar is high because you've climbed higher.",
      "Aquarius": "You're attracting those who get it — not those who drain it.",
      "Pisces": "Your heart's choosier now, and it's a good look."
    }
  },
  "2025-11-28": {
    "quote": "Take the risk. Regret is worse than rejection.",
    "signRoasts": {
      "Aries": "Bold moves pay off today — hesitation will just annoy you.",
      "Taurus": "Comfort zones feel safe, but boredom isn't worth it.",
      "Gemini": "Your charm works best when you actually commit.",
      "Cancer": "Playing it safe protects feelings, but stunts growth.",
      "Leo": "The spotlight's waiting — step into it or someone else will.",
      "Virgo": "Calculated risks count; overthinking will miss the window.",
      "Libra": "Balance is fine, but boldness gets noticed today.",
      "Scorpio": "Go all in; mystery doesn't close deals.",
      "Sagittarius": "Adventure's knocking — open up already.",
      "Capricorn": "A career leap could stick — don't over-plan it away.",
      "Aquarius": "Your idea's ahead of its time; launch it anyway.",
      "Pisces": "Follow the vision; fear's the only real block."
    }
  },
  "2025-11-29": {
    "quote": "You don't need a sign. You need a nap.",
    "signRoasts": {
      "Aries": "The green light's real, but you're too tired to floor it.",
      "Taurus": "Today's vibe is horizontal — lean into it.",
      "Gemini": "Your mind's buzzing, but your body wants off the ride.",
      "Cancer": "Sometimes recharging beats reacting.",
      "Leo": "Rest now; you can reclaim the spotlight tomorrow.",
      "Virgo": "Organizing in your sleep still counts as rest, right?",
      "Libra": "Peace comes from quiet, not more input.",
      "Scorpio": "Even plotting works better after a recharge.",
      "Sagittarius": "Your wanderlust can wait for morning.",
      "Capricorn": "Efficiency starts with energy — refill it.",
      "Aquarius": "Innovation thrives after you stop pushing.",
      "Pisces": "Dreaming counts as spiritual homework today."
    }
  },
  "2025-11-30": {
    "quote": "Protect your peace — even from group chats.",
    "signRoasts": {
      "Aries": "Your patience is thinner than your phone battery.",
      "Taurus": "Mute buttons exist for a reason — use them.",
      "Gemini": "Not every notification deserves your genius reply.",
      "Cancer": "Emotional boundaries mean unread messages are okay.",
      "Leo": "If it's not applause, let it wait.",
      "Virgo": "Chaos in the chat doesn't need your project plan.",
      "Libra": "Your diplomacy is wasted on emoji wars.",
      "Scorpio": "You can vanish without explanation — it's your art.",
      "Sagittarius": "Silence isn't rude when it's for your sanity.",
      "Capricorn": "Group drama isn't part of your KPIs.",
      "Aquarius": "Your detachment skill is peak today — embrace it.",
      "Pisces": "Your vibe stays higher when the phone's face-down."
    }
  },
  "2025-12-01": {
    "quote": "Resting is productive. Crying counts too.",
    "signRoasts": {
      "Aries": "Pause before burnout turns you into a wildfire.",
      "Taurus": "A slow day feeds your strength more than you think.",
      "Gemini": "Reflection beats running in circles.",
      "Cancer": "Tears are your emotional pressure valve — let them flow.",
      "Leo": "Even royalty needs a break from the throne.",
      "Virgo": "Today's to-do list: nothing, and mean it.",
      "Libra": "Balance is rest too, not just action.",
      "Scorpio": "Still waters sharpen the sting later.",
      "Sagittarius": "You can't chase sunsets every day — take five.",
      "Capricorn": "Recovery is an investment, not a loss.",
      "Aquarius": "Innovation sneaks in when you're still.",
      "Pisces": "Your soul work happens best in quiet moments."
    }
  },
  "2025-12-02": {
    "quote": "Confidence looks good on you. Arrogance doesn't.",
    "signRoasts": {
      "Aries": "Lead with certainty, not volume.",
      "Taurus": "Stability is strength; flaunting it is overkill.",
      "Gemini": "Your wit sparkles — just don't turn it into a weapon.",
      "Cancer": "Soft confidence beats defensive walls.",
      "Leo": "You own the room, but let them breathe too.",
      "Virgo": "Precision speaks louder than smugness.",
      "Libra": "Charm doesn't need constant validation.",
      "Scorpio": "Intensity is magnetic — unless it's suffocating.",
      "Sagittarius": "Freedom shines when you're not preaching it.",
      "Capricorn": "Authority's natural — arrogance takes effort.",
      "Aquarius": "Originality impresses more than superiority.",
      "Pisces": "Grace wins over the urge to prove yourself."
    }
  },
  "2025-12-03": {
    "quote": "Everyone's rooting for you. Even the petty ones.",
    "signRoasts": {
      "Aries": "Your wins fire up allies — and rivals in equal measure.",
      "Taurus": "Steady progress earns claps, even from critics.",
      "Gemini": "Your charm wins fans, grudging or not.",
      "Cancer": "Your persistence forces respect.",
      "Leo": "Even envy looks like admiration on you.",
      "Virgo": "Your results speak louder than their side-eyes.",
      "Libra": "Your grace gets noticed, even by the jealous.",
      "Scorpio": "Haters cheer quietly when you're out of earshot.",
      "Sagittarius": "Even the ones you left behind watch you win.",
      "Capricorn": "Your grind wins nods, even from competitors.",
      "Aquarius": "They may not get you, but they still bet on you.",
      "Pisces": "Your softness wins over even the bitter hearts."
    }
  },
  "2025-12-04": {
    "quote": "Rejection is redirection. Toward someone better.",
    "signRoasts": {
      "Aries": "One 'no' clears the path for a bigger yes.",
      "Taurus": "The wrong fit falls away to make space for gold.",
      "Gemini": "Every closed door is a plot twist you'll retell.",
      "Cancer": "Not everyone deserves access to your heart anyway.",
      "Leo": "A bruise now saves a scar later.",
      "Virgo": "Precision pays — this was the wrong match by design.",
      "Libra": "A better balance is ahead; trust the reset.",
      "Scorpio": "This rejection just sharpened your aim.",
      "Sagittarius": "The detour's better than the dead end you avoided.",
      "Capricorn": "The no today protects your long game.",
      "Aquarius": "The universe just filtered out bad code.",
      "Pisces": "A new tide's coming in — this one was sinking."
    }
  },
  "2025-12-05": {
    "quote": "Trust the timing. Or blame Saturn.",
    "signRoasts": {
      "Aries": "The wait drags, but the launch will be sweeter.",
      "Taurus": "Patience is the power move today.",
      "Gemini": "Delays are just plot twists in your timeline.",
      "Cancer": "The pause protects your peace.",
      "Leo": "Saturn's slow pace teaches humility — reluctantly.",
      "Virgo": "Trust the process, not your stopwatch.",
      "Libra": "Balance comes from letting the clock work its magic.",
      "Scorpio": "Power builds in stillness; use it.",
      "Sagittarius": "Adventure waits until the map's ready.",
      "Capricorn": "Saturn's rules favor your discipline.",
      "Aquarius": "The timing will sync once you stop fighting it.",
      "Pisces": "The tide knows when to pull you forward."
    }
  },
  "2025-12-06": {
    "quote": "You're glowing. It might be rage, but still.",
    "signRoasts": {
      "Aries": "The fire's visible today — channel it or burn bridges.",
      "Taurus": "Your steady shine hides a slow simmer.",
      "Gemini": "Your sparkle comes with a side of side-eye.",
      "Cancer": "Emotions light you up, for better or worse.",
      "Leo": "Your radiance today could scorch a few egos.",
      "Virgo": "Polished outside, boiling point inside.",
      "Libra": "The glow attracts — they just don't know it's dangerous.",
      "Scorpio": "Your allure today is slightly menacing.",
      "Sagittarius": "Your warmth is real — so's the wildfire risk.",
      "Capricorn": "The shine comes with sharp edges.",
      "Aquarius": "You're radiant, but untouchable.",
      "Pisces": "The dreamy light has a storm under it."
    }
  },
  "2025-12-07": {
    "quote": "You're not behind. You're just on Taurus Time™.",
    "signRoasts": {
      "Aries": "The pace feels slow, but you're still ahead of the pack.",
      "Taurus": "Your timeline is the only one that matters.",
      "Gemini": "Others sprint; you're busy enjoying the detour.",
      "Cancer": "The slower rhythm keeps you steady.",
      "Leo": "You're not late — you're perfectly dramatic.",
      "Virgo": "Every step lands exactly where it should.",
      "Libra": "Balance beats rushing ahead today.",
      "Scorpio": "You're strategic, not slow.",
      "Sagittarius": "You'll get there, but the view's worth savoring.",
      "Capricorn": "Patience strengthens your next move.",
      "Aquarius": "Time bends around your vision anyway.",
      "Pisces": "The flow's on your side — no hurry."
    }
  },
  "2025-12-08": {
    "quote": "If it doesn't bring peace, put it down.",
    "signRoasts": {
      "Aries": "Drop the fight that's just for ego points.",
      "Taurus": "Let go of what rattles your calm.",
      "Gemini": "The drama isn't worth the story today.",
      "Cancer": "Peace matters more than proving you're right.",
      "Leo": "Your spotlight shines brighter without chaos in the frame.",
      "Virgo": "Perfection can wait — serenity first.",
      "Libra": "Choose harmony over the endless debate.",
      "Scorpio": "Release the grudge before it poisons your day.",
      "Sagittarius": "Lighten the load for smoother travel.",
      "Capricorn": "Efficiency thrives in a quiet mind.",
      "Aquarius": "Let your headspace breathe today.",
      "Pisces": "Keep only what keeps you soft."
    }
  },
  "2025-12-09": {
    "quote": "You're the vibe. Others are buffering.",
    "signRoasts": {
      "Aries": "Your pace leaves others struggling to catch up.",
      "Taurus": "Your steady aura outlasts the noise.",
      "Gemini": "You're miles ahead in the conversation.",
      "Cancer": "Your mood sets the tone for the room.",
      "Leo": "Everyone's watching your channel today.",
      "Virgo": "Your clarity makes the lag obvious.",
      "Libra": "You're the playlist they can't skip.",
      "Scorpio": "Your intensity freezes weaker signals.",
      "Sagittarius": "You're already onto the next adventure.",
      "Capricorn": "You're the download that's worth the wait.",
      "Aquarius": "Your wavelength is hard to tune into.",
      "Pisces": "You're streaming pure fantasy energy."
    }
  },
  "2025-12-10": {
    "quote": "Let them underestimate you. It's cute.",
    "signRoasts": {
      "Aries": "They'll doubt you until they're eating your dust.",
      "Taurus": "Their underestimation just buys you more time to win.",
      "Gemini": "The surprise ending is your specialty.",
      "Cancer": "Soft doesn't mean weak — they'll learn.",
      "Leo": "You'll turn their doubt into applause.",
      "Virgo": "Quiet wins leave the deepest mark.",
      "Libra": "Charm your way past their low bar.",
      "Scorpio": "Let them guess wrong — it's fuel.",
      "Sagittarius": "You'll outrun their expectations easily.",
      "Capricorn": "They'll regret betting against your grind.",
      "Aquarius": "You'll outsmart them without breaking a sweat.",
      "Pisces": "Your magic works best when they're not looking."
    }
  },
  "2025-12-11": {
    "quote": "You are the table. Stop begging for a seat.",
    "signRoasts": {
      "Aries": "You build the stage and run the show — act like it.",
      "Taurus": "Your stability is the foundation everyone else leans on.",
      "Gemini": "You bring the whole conversation — and the snacks.",
      "Cancer": "You hold the emotional glue this group runs on.",
      "Leo": "Without you, the spotlight's just a flashlight.",
      "Virgo": "You keep it all running; they should be chasing you.",
      "Libra": "You are the balance they can't replicate.",
      "Scorpio": "Your presence changes the entire game.",
      "Sagittarius": "You bring the stories worth staying for.",
      "Capricorn": "You're the infrastructure everyone depends on.",
      "Aquarius": "Your ideas are the main course here.",
      "Pisces": "You're the atmosphere they can't fake."
    }
  },
  "2025-12-12": {
    "quote": "If you're waiting for a sign, this isn't it. Figure it out.",
    "signRoasts": {
      "Aries": "Your energy is unmatched. So is your ability to mess things up quickly.",
      "Taurus": "You're doing amazing. At avoiding responsibilities.",
      "Gemini": "You're not everyone's cup of tea. You're more like chaotic espresso.",
      "Cancer": "Feelings are not facts. Calm down.",
      "Leo": "Your spotlight obsession is exhausting — for the rest of us.",
      "Virgo": "Perfection isn't possible. But keep spiraling.",
      "Libra": "Trying to please everyone? Good luck with that, sweetie.",
      "Scorpio": "Your trust issues have trust issues.",
      "Sagittarius": "You ghost more than Wi-Fi in the countryside.",
      "Capricorn": "You're not a robot. Try relaxing without guilt. Just once.",
      "Aquarius": "You're quirky. We get it. Now sit down.",
      "Pisces": "Your daydreams won't pay rent. Wake up, moonchild."
    }
  },
  "2025-12-13": {
    "quote": "Stop blaming Mercury. You were a mess before retrograde.",
    "signRoasts": {
      "Aries": "You rushed into another mess? Shocking.",
      "Taurus": "You're still flawless. Still stubborn. Still ignoring everyone.",
      "Gemini": "You're not a personality quiz, pick a lane.",
      "Cancer": "Crying again? It's 9AM. Impressive.",
      "Leo": "Not everything needs to be about you. But nice try.",
      "Virgo": "You reorganized your anxiety. Congrats.",
      "Libra": "Still can't decide? Classic.",
      "Scorpio": "Your mystery is just avoidance with eyeliner.",
      "Sagittarius": "Running away isn't growth. It's cardio.",
      "Capricorn": "Work isn't therapy. Stop treating it like it is.",
      "Aquarius": "You're not above feelings. You're just bad at them.",
      "Pisces": "Dreaming again? Cool. Wake up though."
    }
  },
  "2025-12-14": {
    "quote": "Hydrate. Not emotionally — with actual water.",
    "signRoasts": {
      "Aries": "Your energy will be unstoppable today, but coffee isn't water, champ.",
      "Taurus": "Comfort is your priority, but maybe include a glass of water with that snack.",
      "Gemini": "Conversations will flow — unlike your water intake.",
      "Cancer": "Emotions are high tide, but tears won't hydrate you.",
      "Leo": "Attention will find you, but so should a reusable bottle.",
      "Virgo": "A productive streak is coming, but dehydration will ruin your flow.",
      "Libra": "A decision about sparkling or still may derail your morning.",
      "Scorpio": "Passions run deep today, but so will your thirst if you ignore it.",
      "Sagittarius": "Adventure calls — pack more than one sip of water.",
      "Capricorn": "Work momentum is strong, but breaks aren't weakness.",
      "Aquarius": "You'll crave novelty; water is still allowed to be basic.",
      "Pisces": "Your dreams feel vivid — maybe because you're slightly dried out."
    }
  },
  "2025-12-15": {
    "quote": "Your intuition is right. Unfortunately.",
    "signRoasts": {
      "Aries": "A flash of insight hits, but you'll still jump in headfirst.",
      "Taurus": "Your gut will whisper the truth, but comfort will talk louder.",
      "Gemini": "An inner voice warns you — you'll probably debate it out loud anyway.",
      "Cancer": "Your hunch is spot-on, yet your heart will try to rewrite the ending.",
      "Leo": "Validation arrives, and you'll frame it as proof you're always right.",
      "Virgo": "Details confirm what you suspected — try not to micromanage destiny.",
      "Libra": "Instinct will settle the matter, unless you crowdsource more opinions.",
      "Scorpio": "Your sixth sense is sharp — so is the smirk you'll wear all day.",
      "Sagittarius": "Signs will be obvious; whether you stay put is another story.",
      "Capricorn": "The forecast is clear — and you've already built a backup plan.",
      "Aquarius": "Your prediction lands, though you'll credit 'data,' not feelings.",
      "Pisces": "The dream was right, but you'll still test it the hard way."
    }
  },
  "2025-12-16": {
    "quote": "Don't chase. Attract. Then ignore them.",
    "signRoasts": {
      "Aries": "The spotlight finds you, but you'll be too busy moving to notice.",
      "Taurus": "Admiration comes your way; you'll act like you didn't see it.",
      "Gemini": "Magnetic energy today — until you vanish mid-conversation.",
      "Cancer": "Someone approaches, but you'll retreat into your comfort shell.",
      "Leo": "The crowd adores you, but you'll get bored of the applause.",
      "Virgo": "Attention finds you — only to be met with your critique.",
      "Libra": "Your charm draws people in, indecision sends them out.",
      "Scorpio": "They'll chase your mystery, and you'll enjoy shutting the door.",
      "Sagittarius": "Interest sparks, but your travel plans come first.",
      "Capricorn": "Opportunities show up — you'll pencil them in for next month.",
      "Aquarius": "People match your vibe, you'll still act like you're above it.",
      "Pisces": "They'll fall for the dream; you'll wake up and leave."
    }
  },
  "2025-12-17": {
    "quote": "Growth is painful. So is your taste in people.",
    "signRoasts": {
      "Aries": "Progress feels real today — just avoid dating chaos magnets.",
      "Taurus": "Stability grows, but so might your attachment to bad habits.",
      "Gemini": "Lessons land, but you'll still text the red flag at midnight.",
      "Cancer": "You're healing, yet watering dead emotional plants again.",
      "Leo": "Self-awareness rises, but so does your taste for drama.",
      "Virgo": "Fixing people won't count as personal growth, no matter how neat.",
      "Libra": "Love lessons return — and so does your taste for challenges.",
      "Scorpio": "Transformation thrives, but revenge will still tempt you.",
      "Sagittarius": "Wisdom expands, yet so does your questionable dating history.",
      "Capricorn": "You'll level up — but your romance choices remain an HR violation.",
      "Aquarius": "Growth is happening, but you'll still collect weirdos like art.",
      "Pisces": "Emotional clarity comes, but you'll romanticize the mess."
    }
  },
  "2025-12-18": {
    "quote": "You're not tired. You're uninspired.",
    "signRoasts": {
      "Aries": "The fire's still there — you're just chasing the wrong spark.",
      "Taurus": "Energy dips, not because you're exhausted, but because the couch exists.",
      "Gemini": "Ideas swirl, yet none land long enough to excite you.",
      "Cancer": "Your mood feels heavy, but it's boredom wearing a disguise.",
      "Leo": "The stage feels dull; maybe the problem isn't the stage.",
      "Virgo": "You've organized your day to death — no wonder it's lifeless.",
      "Libra": "The scales feel off because nothing's thrilling you.",
      "Scorpio": "Motivation hides; plotting isn't the same as doing.",
      "Sagittarius": "Restlessness hits, but adventure feels too far away.",
      "Capricorn": "Work is steady, but passion's running on empty.",
      "Aquarius": "Routine is choking your weird — shake it up.",
      "Pisces": "Your dreams feel more alive than your to-do list."
    }
  },
  "2025-12-19": {
    "quote": "Be the main character. But not in a cringe way.",
    "signRoasts": {
      "Aries": "The plot moves fast — make sure it's not just a chase scene.",
      "Taurus": "Slow and steady is fine, unless the movie's boring.",
      "Gemini": "Your subplot is stealing the show; maybe focus on one arc.",
      "Cancer": "Tears will roll in 4K — Oscar-worthy or overdone?",
      "Leo": "Every scene's yours, but not every scene needs you.",
      "Virgo": "You're directing and starring, but also over-editing.",
      "Libra": "The cast loves you — stop auditioning for approval.",
      "Scorpio": "You're craving a twist; just don't set fire to the script.",
      "Sagittarius": "Your role today is 'escape artist,' not hero.",
      "Capricorn": "Ambition's the plot, but even thrillers need downtime.",
      "Aquarius": "You're the eccentric sidekick — embrace it.",
      "Pisces": "The dreamy romantic arc could use subtitles."
    }
  },
  "2025-12-20": {
    "quote": "You survived worse. Like last Monday.",
    "signRoasts": {
      "Aries": "Another crisis passes; somehow you're already chasing the next one.",
      "Taurus": "Resilience shows, but so does your need for a snack break.",
      "Gemini": "You lived, you laughed, you told the group chat everything.",
      "Cancer": "You got through it — with dramatic sighs for effect.",
      "Leo": "You survived and turned it into a TED Talk.",
      "Virgo": "Your coping method involved spreadsheets — again.",
      "Libra": "The storm passed, but you're still deciding how you feel about it.",
      "Scorpio": "You made it through — and left a few scorched bridges behind.",
      "Sagittarius": "You outran the problem, just barely.",
      "Capricorn": "You pushed through like it was a quarterly report.",
      "Aquarius": "You stayed detached, maybe too detached.",
      "Pisces": "You drifted through it in your own emotional current."
    }
  },
  "2025-12-21": {
    "quote": "Not everyone deserves your energy. Especially Steve.",
    "signRoasts": {
      "Aries": "Your fire burns bright today — don't waste it on people who run cold.",
      "Taurus": "Save your effort for what feeds you, not what drains you.",
      "Gemini": "Your words hold power, but some folks aren't worth the monologue.",
      "Cancer": "Protect your peace; not every sob story is your mission.",
      "Leo": "Your glow's strong — stop shining on those who can't reflect it.",
      "Virgo": "Invest energy in progress, not pointless fixes.",
      "Libra": "Your charm isn't a free resource for time-wasters.",
      "Scorpio": "Not everyone deserves the inside scoop on your life.",
      "Sagittarius": "Your vibe's high — no need to lower it for company.",
      "Capricorn": "Keep focus on your goals, not petty distractions.",
      "Aquarius": "Your ideas are gold — stop pitching them to fools.",
      "Pisces": "Your empathy's strong; aim it at someone who cares."
    }
  },
  "2025-12-22": {
    "quote": "Your standards aren't too high — they're just finally accurate.",
    "signRoasts": {
      "Aries": "Today you'll want more, and that's not arrogance — it's survival.",
      "Taurus": "Quality over quantity wins; keep your bar steady.",
      "Gemini": "Your shifting tastes settle for once — make them count.",
      "Cancer": "Emotional boundaries hold firm today; it's about time.",
      "Leo": "You'll expect the best and watch mediocrity scurry away.",
      "Virgo": "You're right to refine your checklist — it's filtering the noise.",
      "Libra": "Your balance today comes from not settling, finally.",
      "Scorpio": "You'll demand depth — and walk when it's shallow.",
      "Sagittarius": "Freedom feels better without dead weight tagging along.",
      "Capricorn": "Your bar is high because you've climbed higher.",
      "Aquarius": "You're attracting those who get it — not those who drain it.",
      "Pisces": "Your heart's choosier now, and it's a good look."
    }
  },
  "2025-12-23": {
    "quote": "Take the risk. Regret is worse than rejection.",
    "signRoasts": {
      "Aries": "Bold moves pay off today — hesitation will just annoy you.",
      "Taurus": "Comfort zones feel safe, but boredom isn't worth it.",
      "Gemini": "Your charm works best when you actually commit.",
      "Cancer": "Playing it safe protects feelings, but stunts growth.",
      "Leo": "The spotlight's waiting — step into it or someone else will.",
      "Virgo": "Calculated risks count; overthinking will miss the window.",
      "Libra": "Balance is fine, but boldness gets noticed today.",
      "Scorpio": "Go all in; mystery doesn't close deals.",
      "Sagittarius": "Adventure's knocking — open up already.",
      "Capricorn": "A career leap could stick — don't over-plan it away.",
      "Aquarius": "Your idea's ahead of its time; launch it anyway.",
      "Pisces": "Follow the vision; fear's the only real block."
    }
  },
  "2025-12-24": {
    "quote": "You don't need a sign. You need a nap.",
    "signRoasts": {
      "Aries": "The green light's real, but you're too tired to floor it.",
      "Taurus": "Today's vibe is horizontal — lean into it.",
      "Gemini": "Your mind's buzzing, but your body wants off the ride.",
      "Cancer": "Sometimes recharging beats reacting.",
      "Leo": "Rest now; you can reclaim the spotlight tomorrow.",
      "Virgo": "Organizing in your sleep still counts as rest, right?",
      "Libra": "Peace comes from quiet, not more input.",
      "Scorpio": "Even plotting works better after a recharge.",
      "Sagittarius": "Your wanderlust can wait for morning.",
      "Capricorn": "Efficiency starts with energy — refill it.",
      "Aquarius": "Innovation thrives after you stop pushing.",
      "Pisces": "Dreaming counts as spiritual homework today."
    }
  },
  "2025-12-25": {
    "quote": "Protect your peace — even from group chats.",
    "signRoasts": {
      "Aries": "Your patience is thinner than your phone battery.",
      "Taurus": "Mute buttons exist for a reason — use them.",
      "Gemini": "Not every notification deserves your genius reply.",
      "Cancer": "Emotional boundaries mean unread messages are okay.",
      "Leo": "If it's not applause, let it wait.",
      "Virgo": "Chaos in the chat doesn't need your project plan.",
      "Libra": "Your diplomacy is wasted on emoji wars.",
      "Scorpio": "You can vanish without explanation — it's your art.",
      "Sagittarius": "Silence isn't rude when it's for your sanity.",
      "Capricorn": "Group drama isn't part of your KPIs.",
      "Aquarius": "Your detachment skill is peak today — embrace it.",
      "Pisces": "Your vibe stays higher when the phone's face-down."
    }
  },
  "2025-12-26": {
    "quote": "Resting is productive. Crying counts too.",
    "signRoasts": {
      "Aries": "Pause before burnout turns you into a wildfire.",
      "Taurus": "A slow day feeds your strength more than you think.",
      "Gemini": "Reflection beats running in circles.",
      "Cancer": "Tears are your emotional pressure valve — let them flow.",
      "Leo": "Even royalty needs a break from the throne.",
      "Virgo": "Today's to-do list: nothing, and mean it.",
      "Libra": "Balance is rest too, not just action.",
      "Scorpio": "Still waters sharpen the sting later.",
      "Sagittarius": "You can't chase sunsets every day — take five.",
      "Capricorn": "Recovery is an investment, not a loss.",
      "Aquarius": "Innovation sneaks in when you're still.",
      "Pisces": "Your soul work happens best in quiet moments."
    }
  },
  "2025-12-27": {
    "quote": "Confidence looks good on you. Arrogance doesn't.",
    "signRoasts": {
      "Aries": "Lead with certainty, not volume.",
      "Taurus": "Stability is strength; flaunting it is overkill.",
      "Gemini": "Your wit sparkles — just don't turn it into a weapon.",
      "Cancer": "Soft confidence beats defensive walls.",
      "Leo": "You own the room, but let them breathe too.",
      "Virgo": "Precision speaks louder than smugness.",
      "Libra": "Charm doesn't need constant validation.",
      "Scorpio": "Intensity is magnetic — unless it's suffocating.",
      "Sagittarius": "Freedom shines when you're not preaching it.",
      "Capricorn": "Authority's natural — arrogance takes effort.",
      "Aquarius": "Originality impresses more than superiority.",
      "Pisces": "Grace wins over the urge to prove yourself."
    }
  },
  "2025-12-28": {
    "quote": "Everyone's rooting for you. Even the petty ones.",
    "signRoasts": {
      "Aries": "Your wins fire up allies — and rivals in equal measure.",
      "Taurus": "Steady progress earns claps, even from critics.",
      "Gemini": "Your charm wins fans, grudging or not.",
      "Cancer": "Your persistence forces respect.",
      "Leo": "Even envy looks like admiration on you.",
      "Virgo": "Your results speak louder than their side-eyes.",
      "Libra": "Your grace gets noticed, even by the jealous.",
      "Scorpio": "Haters cheer quietly when you're out of earshot.",
      "Sagittarius": "Even the ones you left behind watch you win.",
      "Capricorn": "Your grind wins nods, even from competitors.",
      "Aquarius": "They may not get you, but they still bet on you.",
      "Pisces": "Your softness wins over even the bitter hearts."
    }
  },
  "2025-12-29": {
    "quote": "Rejection is redirection. Toward someone better.",
    "signRoasts": {
      "Aries": "One 'no' clears the path for a bigger yes.",
      "Taurus": "The wrong fit falls away to make space for gold.",
      "Gemini": "Every closed door is a plot twist you'll retell.",
      "Cancer": "Not everyone deserves access to your heart anyway.",
      "Leo": "A bruise now saves a scar later.",
      "Virgo": "Precision pays — this was the wrong match by design.",
      "Libra": "A better balance is ahead; trust the reset.",
      "Scorpio": "This rejection just sharpened your aim.",
      "Sagittarius": "The detour's better than the dead end you avoided.",
      "Capricorn": "The no today protects your long game.",
      "Aquarius": "The universe just filtered out bad code.",
      "Pisces": "A new tide's coming in — this one was sinking."
    }
  },
  "2025-12-30": {
    "quote": "Trust the timing. Or blame Saturn.",
    "signRoasts": {
      "Aries": "The wait drags, but the launch will be sweeter.",
      "Taurus": "Patience is the power move today.",
      "Gemini": "Delays are just plot twists in your timeline.",
      "Cancer": "The pause protects your peace.",
      "Leo": "Saturn's slow pace teaches humility — reluctantly.",
      "Virgo": "Trust the process, not your stopwatch.",
      "Libra": "Balance comes from letting the clock work its magic.",
      "Scorpio": "Power builds in stillness; use it.",
      "Sagittarius": "Adventure waits until the map's ready.",
      "Capricorn": "Saturn's rules favor your discipline.",
      "Aquarius": "The timing will sync once you stop fighting it.",
      "Pisces": "The tide knows when to pull you forward."
    }
  },
  "2025-12-31": {
    "quote": "You're glowing. It might be rage, but still.",
    "signRoasts": {
      "Aries": "The fire's visible today — channel it or burn bridges.",
      "Taurus": "Your steady shine hides a slow simmer.",
      "Gemini": "Your sparkle comes with a side of side-eye.",
      "Cancer": "Emotions light you up, for better or worse.",
      "Leo": "Your radiance today could scorch a few egos.",
      "Virgo": "Polished outside, boiling point inside.",
      "Libra": "The glow attracts — they just don't know it's dangerous.",
      "Scorpio": "Your allure today is slightly menacing.",
      "Sagittarius": "Your warmth is real — so's the wildfire risk.",
      "Capricorn": "The shine comes with sharp edges.",
      "Aquarius": "You're radiant, but untouchable.",
      "Pisces": "The dreamy light has a storm under it."
    }
  }
}